opprud/EMB/lpc2478_CAN/drivers/can.c
/**
 * @file
 * @ingroup drv
 * This driver shows how the CAN interface of the Philips LPC2000 can be used to receive ALL messages on the CANbus.
 * @remarks
 *
 */
#include "can.h"
#include "lpc2468.h"
#include "irq.h"
#include "config.h"

/***********************************************************************
 * CAN driver compiler options
 **********************************************************************/

/*Define CPU clock frequency TODO: place somewhere global */
#undef F_CPU_60MHZ

/* Default CAN ring buffer size, buffer size is in no. of CANMSG_T.
 * Each object is 16bytes. For each enabled CAN, a
 * transmit and receive ring buffer of this size will be defined */
#define CAN_RING_BUFSIZE 256

/* The CAN_1_ENABLE define enables support for CAN 1 when set to 1 */
#define CAN_1_ENABLE 1

/* The CAN_2_ENABLE define enables support for CAN 2 when set to 1 */
#define CAN_2_ENABLE 1

/* The CAN_3_ENABLE define enables support for CAN 3 when set to 1 */
//#define CAN_3_ENABLE 1

/* The CAN_4_ENABLE define enables support for CAN 1 when set to 1 */
//#define CAN_4_ENABLE 1

/***********************************************************************
 * IRQ handler prototype
 **********************************************************************/
void CAN_Handler(void) __attribute__ ((interrupt("IRQ")));

/***********************************************************************
 * CAN driver private data and types
 **********************************************************************/
/**
 *  CAN Ring buffer structure
 */
typedef struct
{
   CANMSG_T tx[CAN_RING_BUFSIZE]; ///< CAN Tx data ring buffer
   CANMSG_T rx[CAN_RING_BUFSIZE]; ///< CAN Rx data ring buffer
   int   tx_head;              ///< CAN Tx ring buffer head index
   int   tx_tail;              ///< CAN Tx ring buffer tail index
   int   rx_head;              ///< CAN Rx ring buffer head index
   int   rx_tail;              ///< CAN Rx ring buffer tail index
} CAN_RING_BUFFER_T;              ///< CAN Ring buffer structure

/**
 *  CAN device configuration structure type
 */
typedef struct
{
   int           	 init;     	///< Device initialized flag
   CAN_RING_BUFFER_T rb;       	///< Device ring buffer
   CAN_REGS_T        *regptr;  	///< Pointer to CAN registers
} CAN_CFG_T;                   	///< CAN device configuration structure type

/* CAN device configuration structure for CAN 1 */
#if CAN_1_ENABLE == 1
static CAN_CFG_T can1cfg;
#endif

/* CAN device configuration structure for CAN 2 */
#if CAN_2_ENABLE == 1
static CAN_CFG_T can2cfg;
#endif

/* CAN device configuration structure for CAN 3 */
#if CAN_3_ENABLE == 1
static CAN_CFG_T can3cfg;
#endif

/* CAN device configuration structure for CAN 3 */
#if CAN_4_ENABLE == 1
static CAN_CFG_T can4cfg;
#endif

//#ifdef Fpclk == 28800000
////TODO place new baudrates here
//#endif

#ifdef Fcclk == 57600000
/* The bitrate is dependent on the clock frequency, and for a
 *  setup with cclk = 57.7MHz (using PLL) and PCLKDIV = 1:
 *
 *  Bitrate = cclk / ( VPBDIV * (BRP+1) * ( TSEG1+1 + 1 + TSEG2+1))
 *
 *  CAN Bit Timings      SAM TSEG1 TSEG2 SJW SP%  BRP
 *  20kBaud              0+1  5+1   2+1  3+1 70  149+1
 *  50kBaud              0+1  5+1   2+1  3+1 70   59+1
 *  100kBaud             0+1  5+1   2+1  3+1 70   14+1
 *  125kBaud             0+1  5+1   2+1  3+1 70   11+1
 *  250kBaud             0+1  5+1   2+1  3+1 70    5+1
 *  500kBaud             0+1  5+1   2+1  3+1 70    2+1
 *  1000kBaud            0+1  8+1   4+1  3+1 67    0+1
 *
 * Use "CAN baudrate calculator.xls"
 * to caculate baudrates for other CPU frequencies
 */
/* Common CAN bit rates */
#define  CAN_BRP_25K          127
#define  CAN_BRP_50K          63
#define  CAN_BRP_100K         31
#define  CAN_BRP_125K         25
#define  CAN_BRP_250K         12
#define  CAN_BRP_500K         5
#define  CAN_BRP_1000K        2

#define CAN_BRP_DEFAULT			CAN_BRP_125K
/* Predefined timing parameters for the CAN bus  when running 10-500kbps
 * A CAN telegram
 *
 * */
#define	CAN_SJW					3
#define	CAN_TSEG1				10
#define	CAN_TSEG2				5
#define	CAN_SAM					0

/* Predefined timing parameters for the CAN bus  when running 1000kbps*/
#define	CAN_SJW_1000K			3
#define	CAN_TSEG1_1000K		    11
#define	CAN_TSEG2_1000K		    5
#define	CAN_SAM_1000K			0

#else
#error NO Valid Fcclk defined, currently only "57.6MHZ" supported
#endif

/* ---------------------- PRIVATE FUNCTIONS ------------------------ */

/**
 *
 * Function: can_standard_receive
 *
 * Purpose: Common CAN receive function
 *
 * Processing:
 *     If the CAN RX registers holds data, read a data
 *     block from it and place it into the receive ring buffer
 *     indexed by the head pointer. Increment the head pointer and reset
 *     it to the start of the ring buffer if it overflows.
 *
 * @param cancfg: Pointer to CAN config structure
 *
 * Outputs: None
 *
 * @return : Nothing
 *
 * @remarks :
 *     There is no protection against overflowing the ring buffer.
 *
 */
static void can_standard_receive(CAN_CFG_T *cancfg)
{
   CAN_REGS_T *canregs = cancfg->regptr;

   /* Copy CAN RX data to RX circular buffer */
   cancfg->rb.rx[cancfg->rb.rx_head].Frame.Bit.DLC = canregs->canrfs.DLC;
   cancfg->rb.rx[cancfg->rb.rx_head].Frame.Bit.RTR = canregs->canrfs.RTR;
   cancfg->rb.rx[cancfg->rb.rx_head].Frame.Bit.FF  = canregs->canrfs.FF;
   cancfg->rb.rx[cancfg->rb.rx_head].MsgID         = canregs->canrid.ID29_0;
   cancfg->rb.rx[cancfg->rb.rx_head].Data[0]       = canregs->canrda.Data1;
   cancfg->rb.rx[cancfg->rb.rx_head].Data[1]       = canregs->canrda.Data2;
   cancfg->rb.rx[cancfg->rb.rx_head].Data[2]       = canregs->canrda.Data3;
   cancfg->rb.rx[cancfg->rb.rx_head].Data[3]       = canregs->canrda.Data4;
   cancfg->rb.rx[cancfg->rb.rx_head].Data[4]       = canregs->canrdb.Data5;
   cancfg->rb.rx[cancfg->rb.rx_head].Data[5]       = canregs->canrdb.Data6;
   cancfg->rb.rx[cancfg->rb.rx_head].Data[6]       = canregs->canrdb.Data7;
   cancfg->rb.rx[cancfg->rb.rx_head].Data[7]       = canregs->canrdb.Data8;

   /* Increment receive ring buffer head pointer */
   cancfg->rb.rx_head++;
   if (cancfg->rb.rx_head >= CAN_RING_BUFSIZE)
   {
      cancfg->rb.rx_head = 0;
   }

