opprud/EMB/lpc2478_CAN/drivers/can.c
   /* Release receive buffer */
   canregs->cancmr.RRB = 1;
}

/**
 *
 * Function: can_standard_transmit
 *
 * Purpose: Common CAN transmit function
 *
 * Processing:
 *     While there is data to transmit in the ring buffer, write a data value
 *     from the ring buffer into the next available three-buffer transmit
 *     queue of the selected CAN interface.
 *     Increment the transmit ring buffer tail pointer and reset
 *     it to the start of the ring buffer
 *     if it overflows. If all the data has been transmitted from
 *     the ring buffer, disable the transmit interrupt, otherwise
 *     (re)enable it.
 *
 * @param :
 *     cancfg: Pointer to CAN config structure
 *
 * Outputs: None
 *
 * @return : Nothing
 *
 * @remarks : None
 *
 */
static void can_standard_transmit(CAN_CFG_T *cancfg)
{
   CAN_REGS_T *canregs = cancfg->regptr;

   /* If TX queue is empty, return */
   if (cancfg->rb.tx_head == cancfg->rb.tx_tail)
   {
      /* Disable CAN TX interrupt */
      canregs->canier.TIE1 = 0;
      return;
   }

   /* Add data to TX buffer*/
   if (canregs->cansr.TBS1)
   {
      /* Now that we have a TX buffer, start filling it up */
      /* Write DLC, RTR and FF */
      canregs->cantfi1.DLC = (cancfg->rb.tx[cancfg->rb.tx_tail].Frame.Bit.DLC);
      canregs->cantfi1.RTR = (cancfg->rb.tx[cancfg->rb.tx_tail].Frame.Bit.RTR);
      canregs->cantfi1.FF  = (cancfg->rb.tx[cancfg->rb.tx_tail].Frame.Bit.FF);

      /* Write CAN ID */
      canregs->cantid1.ID29_0 = (cancfg->rb.tx[cancfg->rb.tx_tail].MsgID);

      /* Write first 4 data bytes */
      canregs->cantda1.Data1 = (cancfg->rb.tx[cancfg->rb.tx_tail].Data[0]);
      canregs->cantda1.Data2 = (cancfg->rb.tx[cancfg->rb.tx_tail].Data[1]);
      canregs->cantda1.Data3 = (cancfg->rb.tx[cancfg->rb.tx_tail].Data[2]);
      canregs->cantda1.Data4 = (cancfg->rb.tx[cancfg->rb.tx_tail].Data[3]);

      /* Write next 4 data bytes */
      canregs->cantdb1.Data5 = (cancfg->rb.tx[cancfg->rb.tx_tail].Data[4]);
      canregs->cantdb1.Data6 = (cancfg->rb.tx[cancfg->rb.tx_tail].Data[5]);
      canregs->cantdb1.Data7 = (cancfg->rb.tx[cancfg->rb.tx_tail].Data[6]);
      canregs->cantdb1.Data8 = (cancfg->rb.tx[cancfg->rb.tx_tail].Data[7]);

      /* Set TX flag on the buffer used */
      canregs->cancmr.STB1 = 1;

      /* Update transmit ring FIFO tail pointer */
      cancfg->rb.tx_tail++;

      /* If we have reached the end, roll back to start */
      if (cancfg->rb.tx_tail >= CAN_RING_BUFSIZE)
         cancfg->rb.tx_tail = 0;

      /* (Re)Enable CAN TX interrupt */
      canregs->canier.TIE1 = 1;

      /* Write transmission request */
      canregs->cancmr.TR = 1;
   }
}

/**
 *
 * Function: can_get_free_tx_count
 *
 * Purpose: Return the amount of free space in the transmit ring buffer
 *
 * Processing:
 *     Compute a count value by subtracting the transmit ring buffer
 *     tail index from the head index. If the value is less than 0,
 *     then recompute the count value adding the head index to the
 *     total ring buffer size minus the tail index. Return the number
 *     of free entries left in the ring buffer by subtracting the
 *     (count + 1) from the total ring buffer size.
 *
 * @param :
 *     cancfg: Pointer to CAN config structure
 *
 * Outputs: None
 *
 * @return : The number of free bytes in the transmit ring buffer
 *
 * @remarks : None
 *
 */
static int can_get_free_tx_count(CAN_CFG_T *cancfg)
{
   int count = 0;

   count = cancfg->rb.tx_head - cancfg->rb.tx_tail;
   if (count < 0)
   {
      /* head pointer has flipped to start of ringbuffer */
      count = (CAN_RING_BUFSIZE - cancfg->rb.tx_tail) + cancfg->rb.tx_head;
   }

   return (CAN_RING_BUFSIZE - count - 1);
}

/* ---------------------- PUBLIC FUNCTIONS ------------------------ */

/**
 *     Determine the CAN configuration structure to use based on the
 *     passed arg value. If the arg value doesn't match an available
 *     CAN block, return NULL to the caller. Otherwise, check the status of
 *     the init flag. If it is TRUE, return NULL to the caller.
 *     Otherwise, set init to TRUE and save the pointer to the CAN
 *     registers.
 *     Set the receive and transmit ring buffers to empty by setting
 *     the head and tail pointers to 0. Default the CAN is set to
 *     125K baudrate.
 *
 *
 *     @param *ipbase: CAN descriptor device address
 *     @param arg - Not used
 */
int can_open(void *ipbase, signed int arg)
{
   CAN_CFG_T *cancfg;
   CAN_REGS_T *canregs;

   /* Invalid or disabled CAN */
   cancfg = (CAN_CFG_T *) NULL;

#if CAN_1_ENABLE == 1
   if ((CAN_REGS_T *) ipbase == CAN1)
   {
      /* CAN 1 selected */
      cancfg = &can1cfg;
      /* Enable CAN 1 */
      PCONP |= (1 << 13);
      /* Set bit P0.0:RD1  P0.1:TD1 */
      PINSEL0 &= ~0x0000000F;
      PINSEL0 |=  0x0000005;
   }
#endif

#if CAN_2_ENABLE == 1
   if ((CAN_REGS_T *) ipbase == CAN2)
   {
      /* CAN 2 selected */
      cancfg = &can2cfg;
      /* Enable CAN 2 */
      PCONP |= (1 << 14);
      /* Set bit P0.4:RD2  P0.5:TD2 */
      PINSEL0 &= ~0x00000F00;
      PINSEL0 |=  0x0000A05;
   }
#endif

#if CAN_3_ENABLE == 1
   if ((CAN_REGS_T *) ipbase == CAN3)
   {
      /* CAN 3 selected */
      cancfg = &can3cfg;
      /* Set bits 11 and 12 */
      PINSEL1 |= 0x00001800L;
   }
#endif

#if CAN_4_ENABLE == 1
   if ((CAN_REGS_T *) ipbase == CAN4)
   {
      /* CAN 4 selected */
      cancfg = &can3cfg;
      /* Set bits 24 to 27 */
      PINSEL0 |= 0x0F000000L;
   }
#endif

   if (cancfg != (CAN_CFG_T *) NULL)
   {
      /* Valid CAN selected, has it been previously initialized? */
      if (cancfg->init == FALSE)
      {
         /* Device not initialized and it is usable, so set it to used */
         cancfg->init = TRUE;

         /* Save address of register block */
         cancfg->regptr = (CAN_REGS_T *) ipbase;
         canregs = (CAN_REGS_T *) ipbase;//MOJ

         /* Acceptance Filter Mode Register = filter off, receive all */
         CAN_AFMR = 0x00000002L;

         /* Go into Reset mode */
         canregs->canmod.RM = 1;

