opprud/EMB/lpc2478_CAN/drivers/can.c
         /* Clear Status register */
         canregs->cangsr.RBS   = 0;
         canregs->cangsr.DOS   = 0;
         canregs->cangsr.ES    = 0;
         canregs->cangsr.RBS   = 0;
         canregs->cangsr.RS    = 0;
         canregs->cangsr.RXERR = 0;
         canregs->cangsr.TBS   = 1;
         canregs->cangsr.TCS   = 1;
         canregs->cangsr.TS    = 0;
         canregs->cangsr.TXERR = 0;

         /* Set bit timing */
         canregs->canbtr.BRP   = CAN_BRP_DEFAULT;
         canregs->canbtr.SJW   = CAN_SJW;
         canregs->canbtr.TSEG1 = CAN_TSEG1;
         canregs->canbtr.TSEG2 = CAN_TSEG2;
         canregs->canbtr.SAM   = CAN_SAM;

         /* Enable Receive and Transmit Interrupt */
         canregs->canier.RIE  = 1;
         canregs->canier.TIE1 = 1;

         /* Initialize the ring buffers */
         cancfg->rb.tx_head = cancfg->rb.tx_tail = 0;
         cancfg->rb.rx_head = cancfg->rb.rx_tail = 0;

         /* Set Operating Mode */
         canregs->canmod.RM = 0;

         /* Install CAN interrupt handlern note! this can be called multiple times */
         install_irq( CAN_INT, (void *)CAN_Handler, HIGHEST_PRIORITY );
      }
   }
   return (int) cancfg;
}

/**
 *
 * Function: can_close
 *
 * Purpose: Close a CAN
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR to the caller as the
 *     device was not previously opened. Otherwise, disable the CAN,
 *     set init to FALSE, and return _NO_ERROR to the caller.
 *
 * @param :
 *     devid: Pointer to CAN config structure
 *
 * Outputs: None
 *
 * @return : The status of the close operation
 *
 * @remarks : None
 *
 */
int can_close(int devid)
{
   CAN_CFG_T *cancfgptr = (CAN_CFG_T *) devid;
   int status = _ERROR;

   /* First check that device is open*/
   if (cancfgptr->init == TRUE)
   {
      /* CAN1 Selected */
      if (cancfgptr->regptr == CAN1)
         /* Disable CAN 1 */
         PCONP &= ~(1<<13);

      /* CAN2 Selected */
      else if (cancfgptr->regptr == CAN2)
         /* Disable CAN 2 */
    	 PCONP &= ~(1<<14);

      /* Error return */
      else
         return status;

      /* close succeeded */
      status = _NO_ERROR;
      cancfgptr->init = FALSE;
   }
   return status;
}

/**
 *
 * Function: can_ioctl
 *
 * Purpose: CAN configuration block
 *
 * Processing:
 *     This function is a large case block. Based on the passed function
 *     and option values, set or get the appropriate CAN parameter.
 *
 * @param :
 *     devid: Pointer to CAN config structure
 *     cmd:   ioctl command
 *     arg:   ioctl argument
 *
 * Outputs: None
 *
 * @return : The status of the ioctl operation
 *
 * @remarks : None
 *
 */
//extern
int can_ioctl(int devid, int cmd, int arg)
{
   CAN_REGS_T *canregs;
   CAN_CFG_T *cancfgptr = (CAN_CFG_T *) devid;
   int status = _ERROR;
   int carry_on = FALSE;

   if (cancfgptr->init == TRUE)
   {
      status = _NO_ERROR;
      canregs = cancfgptr->regptr;

      switch (cmd)
      {
         case CAN_CLEAR_ERROR_CONDITION:
            canregs->canmod.RM = 1;
            switch (arg)
            {
                case RX_ERROR_CONDITION:
                    canregs->cangsr.RXERR = 0;
                    canregs->cangsr.RBS = 0;
                    canregs->cangsr.ES = 0;
                    canregs->canier.RIE = 1;
                    break;

                case TX_ERROR_CONDITION:
                    canregs->cangsr.TXERR = 0;
                    canregs->cangsr.TBS = 1;
                    canregs->cangsr.ES = 0;
                    canregs->canier.TIE1 = 1;
                    break;
            }
            canregs->canmod.RM = 0;
            break;

         case CAN_SET_MODE:
            switch (arg)
            {
               case MODE_SELF_TEST:
                  /* Reset mode, clears other bits in register to default */
                  canregs->canmod.RM = 1;
                  /* Enable CAN */
                  canregs->canmod.RM = 0;
                  /* Set test mode */
                  canregs->canmod.TM = 1;
                  break;

               case MODE_LISTEN_ONLY:
                  /* Reset mode, clears other bits in register to default */
                  canregs->canmod.RM = 1;
                  /* Set listen only mode */
                  canregs->canmod.LOM = 1;
                  /* Enable CAN */
                  canregs->canmod.RM = 0;
                  break;

               case MODE_OPERATING:
                  /* Enable CAN */
                  canregs->canmod.RM = 0;
                  break;

               case MODE_RESET:
                  /* Disable CAN */
                  canregs->canmod.RM = 1;
                  break;

               default:
                  /* Bad BPS rate */
                  status = SMA_BAD_PARAMS;
            }
            break;

         case CAN_SET_BAUD_RATE:
            /* Go into Reset mode */
            canregs->canmod.RM = 1;
            /* Disable Receive and Transmit Interrupt */
            canregs->canier.RIE  = 0;
            canregs->canier.TIE1 = 0;
            /* Set default sample parameters */
            canregs->canbtr.SJW   = CAN_SJW;
            canregs->canbtr.TSEG1 = CAN_TSEG1;
            canregs->canbtr.TSEG2 = CAN_TSEG2;
            canregs->canbtr.SAM   = CAN_SAM;

            /* Set the bps rate */
            switch (arg)
            {
               case BPS_25K:
                  canregs->canbtr.BRP = CAN_BRP_25K;
                  break;

               case BPS_50K:
                  canregs->canbtr.BRP = CAN_BRP_50K;
                  break;

               case BPS_125K:
                  canregs->canbtr.BRP = CAN_BRP_125K;
                  break;

               case BPS_250K:
                  canregs->canbtr.BRP = CAN_BRP_250K;
                  break;

               case BPS_500K:
                  canregs->canbtr.BRP = CAN_BRP_500K;
                  break;

               case BPS_1000K:
                  canregs->canbtr.BRP   = CAN_BRP_1000K;
                  canregs->canbtr.SJW   = CAN_SJW_1000K;
                  canregs->canbtr.TSEG1 = CAN_TSEG1_1000K;
                  canregs->canbtr.TSEG2 = CAN_TSEG2_1000K;
                  canregs->canbtr.SAM   = CAN_SAM_1000K;
                  break;

               default:
                  /* Bad BPS rate */
                  status = SMA_BAD_PARAMS;
            }

