opprud/EMB/lpc2478_CAN/drivers/can.c
            /* Clear Status register */
            canregs->cangsr.RBS   = 0;
            canregs->cangsr.DOS   = 0;
            canregs->cangsr.ES    = 0;
            canregs->cangsr.RBS   = 0;
            canregs->cangsr.RS    = 0;
            canregs->cangsr.RXERR = 0;
            canregs->cangsr.TBS   = 1;
            canregs->cangsr.TCS   = 1;
            canregs->cangsr.TS    = 0;
            canregs->cangsr.TXERR = 0;

            /* Initialize the ring buffers */
            cancfgptr->rb.tx_head = cancfgptr->rb.tx_tail = 0;
            cancfgptr->rb.rx_head = cancfgptr->rb.rx_tail = 0;


            /* Enable Receive and Transmit Interrupt */
            canregs->canier.RIE  = 1;
            canregs->canier.TIE1 = 1;

            /* Go into operational mode */
            canregs->canmod.RM = 0;

            break;

         case CAN_AUTO_SET_BAUD_RATE:
            /* TODO find out how ?? */

            break;

         case CAN_SET_FILTER:
            /* TODO find out how ?? */
            break;

         case CAN_FORCE_BUS_OFF:
            canregs->cangsr.TXERR = 255; // Force CAN Controller into BUS OFF
             carry_on = FALSE;
             while(!carry_on)
             {
             /*wait for buss-off*/
                if(canregs->cangsr.BS==1)
                {
                    carry_on=TRUE;
                }
             }
            canregs->cangsr.TXERR = 0;   // Clear BUS OFF in CAN Controller
            break;

         case CAN_GET_STATUS:
            switch (arg)
            {
               case CAN_MODE:
                  /* if listen only mode set */
                  if (canregs->canmod.LOM)
                     status = MODE_LISTEN_ONLY;

                  /* if reset mode is set */
                  else if (canregs->canmod.RM)
                     status = MODE_RESET;

                  /* if test mode is set */
                  else if (canregs->canmod.TM)
                     status = MODE_SELF_TEST;

                  /* if normal mode is set */
                  else if (!(canregs->canmod.RM) && !(canregs->canmod.SM))
                     status = MODE_OPERATING;
                  break;

               case CAN_BAUD_RATE:
                  /* decide which baudrate is used */
                  switch (canregs->canbtr.BRP)
                  {
                     case CAN_BRP_25K:
                        status = BPS_25K;
                        break;

                     case CAN_BRP_50K:
                        status = BPS_50K;
                        break;

                     case CAN_BRP_125K:
                        status = BPS_125K;
                        break;

                     case CAN_BRP_250K:
                        status = BPS_250K;
                        break;

                     case CAN_BRP_500K:
                        status = BPS_500K;
                        break;

                     case CAN_BRP_1000K:
                        status = BPS_1000K;
                        break;

                     default:
                        /* Unsupported parameter */
                        status = SMA_BAD_PARAMS;
                  }
                  break;

               case CAN_FILTER_BITS:

                  break;

               case CAN_MASK_BITS:

                  break;

               case CAN_DATA_OVERRUN:
                  status = canregs->cangsr.DOS;
                  break;

               case CAN_ERROR_STATUS:
                  status = canregs->cangsr.ES;
                  break;

               case CAN_BUS_STATUS:
                  status = canregs->cangsr.BS;
                  break;

               case CAN_RX_ERRORS:
                  status = canregs->cangsr.RXERR;
                  break;

               case CAN_TX_ERRORS:
                  status = canregs->cangsr.TXERR;
                  break;

               default:
                  /* Unsupported parameter */
                  status = SMA_BAD_PARAMS;
                  break;
            }
            break;

         default:
            /* Unsupported parameter */
            status = SMA_BAD_PARAMS;
      }
   }

   return status;
}

/**
 *
 * Function: can_read_ring
 *
 * Purpose: CAN read function for interrupt mode (using ring buffers)
 *
 * Processing:
 *     If the init flag for the CAN structure is FALSE, return 0 to
 *     the caller. Otherwise, save the state of the receive interrupts
 *     and disable the receive interrupts. Loop until max_bytes equals
 *     0 or until the receive ring buffer is empty, whichever comes
 *     first. Read the data from the ring buffer  indexed by the tail
 *     pointer and place it into the user buffer. Increment the tail
 *     pointer and user buffer pointer. If the tail pointer exceeds the
 *     buffer size, set the tail pointer to 0. Increment bytes, and
 *     decrement max_bytes. Exit the loop based on the loop conditions,
 *     re-enable the receive interrupts, and return the number of bytes
 *     read to the caller.
 *
 * @param :
 *     devid:     Pointer to CAN config structure
 *     buffer:    Pointer to data buffer to copy to
 *     max_bytes: Number of bytes to read
 *
 * Outputs: None
 *
 * @return : Number of bytes actually read from the ring buffer
 *
 * @remarks : None
 *
 */
int can_read(int devid, void *buffer, int max_bytes)
{
   CAN_REGS_T *canregs;
   unsigned int savedint;
   CAN_CFG_T *cancfgptr = (CAN_CFG_T *) devid;
   CANMSG_T *data = (CANMSG_T *) buffer;
   int bytes = 0;

   if (cancfgptr->init == TRUE)
   {
      canregs = cancfgptr->regptr;

      /* Temporarily lock out CAN receive interrupts during this
       read so the CAN receive interrupt won't cause problems
       with the index values */
      savedint = canregs->canier.RIE;
      canregs->canier.RIE = 0;

      /* Loop until receive FIFO is empty or until max_bytes expires */
      while ((max_bytes > 0)
            && (cancfgptr->rb.rx_tail != cancfgptr->rb.rx_head))
      {
         /* Read data from ring buffer into user buffer */
         *data = cancfgptr->rb.rx[cancfgptr->rb.rx_tail];
         data++;

