opprud/EMB/lpc2478_CAN/drivers/can.c
         /* Update tail pointer */
         cancfgptr->rb.rx_tail++;

         /* Make sure tail didn't overflow */
         if (cancfgptr->rb.rx_tail >= CAN_RING_BUFSIZE)
         {
            cancfgptr->rb.rx_tail = 0;
         }

         /* Increment data count and decrement buffer size count */
         bytes++;
         max_bytes--;
      }

      /* Restore CAN interrupts */
      canregs->canier.RIE = savedint;
   }

   return bytes;
}

/**
 *
 * Function: can_write_ring
 *
 * Purpose: CAN write function for interrupt mode (using ring buffers)
 *
 * Processing:
 *     If the init flag for the CAN structure is FALSE, return 0 to
 *     the caller. Otherwise, disable the receive interrupts. Loop until
 *     n_bytes equals 0 or until the transmit ring buffer is full,
 *     whichever comes first. Write the data from the user buffer to
 *     the transmit ring buffer indexed by the head pointer. Increment
 *     the user buffer pointer and head pointer. If the head pointer
 *     exceeds the buffer size, set the head pointer to 0. Increment
 *     bytes, and decrement n_bytes. Exit the loop based on the loop
 *     conditions. If the number bytes written to the ring buffer was
 *     greater then 0, call the can_standard_transmit() fucntion.
 *     Return the number of bytes read to the caller.
 *
 * @param :
 *     devid:   Pointer to CAN config structure
 *     buffer:  Pointer to data buffer to copy from
 *     n_bytes: Number of telegrams to write
 *
 * Outputs: None
 *
 * @return : Number of bytes actually written to the ring buffer
 *
 * @remarks :
 *     You cannot overflow the transmit ring buffer.
 *
 */
int can_write(int devid, void *buffer, int n_telegrams)
{
   CAN_REGS_T *canregs;
   __canier_bits savedint;
   CAN_CFG_T *cancfgptr = (CAN_CFG_T *) devid;
   CANMSG_T *data = (CANMSG_T *) buffer;
   int bytes = 0;

   if (cancfgptr->init == TRUE)
   {
      canregs = cancfgptr->regptr;

      /* Temporarily lock out CAN transmit interrupts during this
       write so the CAN transmit interrupt won't cause problems
       with the index values */
      savedint.TIE1 = canregs->canier.TIE1;
      savedint.TIE2 = canregs->canier.TIE2;
      savedint.TIE3 = canregs->canier.TIE3;

      /*Disable TX interupts*/
      canregs->canier.TIE1 = canregs->canier.TIE2 = canregs->canier.TIE3 = 0;

      /* Loop until transmit run buffer is full or until n_bytes expires */
      while ((n_telegrams > 0) && (can_get_free_tx_count(cancfgptr) > 0))
      {
         /* Write data from buffer into ring buffer */
         cancfgptr->rb.tx[cancfgptr->rb.tx_head] = *data;
         data++;

         /* Increment head pointer */
         cancfgptr->rb.tx_head++;
         if (cancfgptr->rb.tx_head >= CAN_RING_BUFSIZE)
         {
            cancfgptr->rb.tx_head = 0;
         }

         /* Increment data count and decrement buffer size count */
         bytes++;
         n_telegrams--;
      }

      /* Restore original interrupt state */
      canregs->canier.TIE1 = savedint.TIE1;
      canregs->canier.TIE2 = savedint.TIE2;
      canregs->canier.TIE3 = savedint.TIE3;

      /* Start transmitting */
      can_standard_transmit(cancfgptr);
   }

   return bytes;
}

/** ---------------------- INTERRUPT FUNCTIONS ------------------------ */

/* Dummy variables used for acknowleding interrupts */
unsigned int CanInt;
CAN_REGS_T *tmpcanregs;


void CAN_Handler(void)
{

  /* read CAN Interrupt capture regs */

  /*read from ctrl 1, NOTE! IRQ bits are cleared on read*/
  /*that is interupts are ack'ed*/
  tmpcanregs = can1cfg.regptr;

  /*if this was no TX event*/
  if(tmpcanregs->canicr.RI)
	  can_standard_receive(&can1cfg);

  /*if this was a TX event*/
  if(tmpcanregs->canicr.TI1)
	  can_standard_transmit(&can1cfg);

  /*read from ctrl 1, NOTE! IRQ bits are cleared on read*/
  /*that is interupts are ack'ed*/
  tmpcanregs = can2cfg.regptr;

  /*if this was no TX event*/
  if(tmpcanregs->canicr.RI)
	  can_standard_receive(&can2cfg);

  /*if this was a TX event*/
  if(tmpcanregs->canicr.TI1)
	  can_standard_transmit(&can2cfg);

  VICVectAddr = 0;		/* Acknowledge Interrupt */
}


#ifdef CAN_1_ENABLE
/**
 *  Interrupt Service Routine for RX interupt CAN 1
 */
void CANISR_Rx1(void)
{
   can_standard_receive(&can1cfg);
   /* Acklowledge interupt */
   tmpcanregs = can1cfg.regptr;
   CanInt = tmpcanregs->canicr.TI1;
}

/**
 *  Interrupt Service Routine for TX interupt CAN 1
 */
void CANISR_Tx1(void)
{
   can_standard_transmit(&can1cfg);
   /* Acknowledge interupt */
   tmpcanregs = can1cfg.regptr;
   CanInt = tmpcanregs->canicr.TI1;
}
#endif

#ifdef CAN_2_ENABLE
/**
 *  Interrupt Service Routine for RX interupt CAN 2
 */
void CANISR_Rx2 ( void )
{
   can_standard_receive(&can2cfg);
   /* Acknowledge interupt */
   tmpcanregs = can2cfg.regptr;
   CanInt = tmpcanregs->canicr.TI1;
}

/**
 *  Interrupt Service Routine for TX interupt CAN 1
 */

void CANISR_Tx2 ( void )
{
   can_standard_transmit(&can2cfg);
   /* Acknowledge interupt */
   tmpcanregs = can2cfg.regptr;
   CanInt = tmpcanregs->canicr.TI1;

}
#endif

#ifdef CAN_3_ENABLE
/**
 *  Interrupt Service Routine for RX interupt CAN 3
 */
void CANISR_Rx3 ( void )
{
   can_standard_receive(&can3cfg);
   /* Acknowledge interupt */
   tmpcanregs = can3cfg.regptr;
   CanInt = tmpcanregs->canicr.TI1;
}

/**
 *  Interrupt Service Routine for TX interupt CAN 3
 */
void CANISR_Tx3 ( void )
{
   can_standard_transmit(&can3cfg);
   /* Acknowledge interupt */
   tmpcanregs = can3cfg.regptr;
   CanInt = tmpcanregs->canicr.TI1;
}
#endif

#ifdef CAN_4_ENABLE
/**
 *  Interrupt Service Routine for RX interupt CAN 4
 */
void CANISR_Rx4 ( void )
{
   can_standard_receive(&can4cfg);
   /* Acknowledge interupt */
   tmpcanregs = can4cfg.regptr;
   CanInt = tmpcanregs->canicr.TI1;
}

/**
 *  Interrupt Service Routine for TX interupt CAN 1
 */
void CANISR_Tx4 ( void )
{
   can_standard_transmit(&can4cfg);
   /* Acknowledge interupt */
   tmpcanregs = can4cfg.regptr;
   CanInt = tmpcanregs->canicr.TI1;
}
#endif

/*----------------------- END OF FILE ----------------------------------*/

